# Pandas-Assignment-2

# Sales_Data Analysis

#### Q1.Import necessary libraries

In [1]:
import pandas as pd 
import os

In [24]:
os.getcwd()

'C:\\Users\\karthik\\AdvancePython'

In [23]:
os.chdir('C:\\Users\\karthik\\AdvancePython')

#### Q2.Merge data from each month data sale Data (https://github.com/svkarthik86/Assignment/tree/main/Sales_Data) into one CSV

In [4]:
# hint: 
# step1:download the Sale_date folder contain 12 month file from github link to local current woring directory
# setp2: import os module , use os.listdir() get all file 
#step3: create empty DataFrame as all_month_data
#step4: using for loop to read file locotain contain file and use pd.concat() function to concatenate all the file into one dataFrame
# as all_month_data
# at last store DataFrame all_month_data to all_data.csv 
    
#all_months_data.to_csv("all_data.csv", index=False)

In [21]:
#m1
import pandas as pd
import os
os.chdir('C:\\Users\\karthik\\AdvancePython\Sales_Data')
files=[file for file in os.listdir()]
all_data=pd.concat([pd.read_csv(file) for file in files if file.endswith(".csv")])
all_data.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"

In [25]:
#m2
import pandas as pd
import os
path=r"C:\Users\karthik\AdvancePython\Sales_Data\\"
files=[file for file in os.listdir('Sales_Data')]
all_data=pd.DataFrame()
for file in files:
    df=pd.read_csv(path+file)
    all_data=pd.concat([all_data,df])
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [26]:
all_data.to_csv("all_data.csv",index=False)  # save all_data DateFrame object to all_data.csv

In [ ]:
#all_data.reset_index(inplace=True,drop=True)

In [ ]:
#all_data.reset_index(inplace=True,drop=True) #reset index and drop the insert of old index

In [27]:
all_data.shape

(186850, 6)

#### Q3.Read the all_data.csv in updated dataframe, and display the first five row of the dataframe

In [28]:
#hint
all_data_2019=pd.read_csv("all_data.csv")

In [31]:
all_data_2019.head(3)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"

### Q4.Clean up the data! 
- check the isnan is present in data, if there is nan is present remove the nan using dropna() function

In [32]:
all_data_2019.isna().sum()

Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64

### Find NAN and Drop rows of NAN

In [ ]:
#all_data_2019=all_data_2019[~(all_data_2019.isna().any(axis=1))]  # drop nan value using negative index

In [33]:
all_data_2019.dropna(how='any',inplace=True) #    saledata_2019=saledata_2019.dropna()

In [35]:
all_data_2019.shape

(186305, 6)

In [36]:
186850-186305  # removed rows of contain NaN value

545

#### Q5.Add month column to all_data DataFrame object from 'Order Date' column using Series.str method

In [37]:
#hint  
all_data_2019['month']=all_data_2019['Order Date'].str[0:2]

In [38]:
all_data_2019.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 186305 entries, 0 to 186849
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
 6   month             186305 non-null  object
dtypes: object(7)
memory usage: 11.4+ MB

### Q6. converts the datatype of month column as int  using astype('int32')

##### Get rid of text in order date column

In [39]:
all_data_2019[all_data_2019['month'].str.contains("Or")]

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,month
519,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
1149,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
1155,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
2878,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
2893,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
...,...,...,...,...,...,...,...
185164,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
185551,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
186563,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
186632,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
186738,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or

In [40]:
all_data_2019=all_data_2019[~(all_data_2019['month'].str.contains("Or"))]  # remove the row contain"Or" values

In [41]:
all_data_2019[all_data_2019['month'].str.contains("Or")] # check again

Empty DataFrame
Columns: [Order ID, Product, Quantity Ordered, Price Each, Order Date, Purchase Address, month]
Index: []

In [50]:
all_data_2019['month']=all_data_2019['Order Date'].str[0:2].astype('int32')

C:\Users\karthik\AppData\Local\Temp\ipykernel_17532\1651208594.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  all_data_2019['month']=all_data_2019['Order Date'].str[0:2].astype('int32')

In [52]:
all_data_2019.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185950 entries, 0 to 186849
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  object
 3   Price Each        185950 non-null  object
 4   Order Date        185950 non-null  object
 5   Purchase Address  185950 non-null  object
 6   month             185950 non-null  int32
dtypes: int32(1), object(6)
memory usage: 10.6+ MB

### Q7.Add sale column to all_data DataFrame object using
-```all_data['Sales'] = all_data['Quantity Ordered'].astype('int') * all_data['Price Each'].astype('float')```

In [53]:
all_data_2019['Sales']=all_data_2019['Quantity Ordered'].astype('int')* all_data_2019['Price Each'].astype('float')

C:\Users\karthik\AppData\Local\Temp\ipykernel_17532\1575324218.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  all_data_2019['Sales']=all_data_2019['Quantity Ordered'].astype('int')* all_data_2019['Price Each'].astype('float')

In [55]:
all_data_2019.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,month,Sales
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001",4,23.90
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215",4,99.99
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001",4,600.00
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001",4,11.99
5,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001",4,11.99

### Q8.find out the day,in which sales is high? using gruop by agg function

In [57]:
all_data_2019.groupby("Order Date")['Sales'].agg(sum).sort_values(ascending=False)[[0]]

Order Date
04/22/19 13:26    4017.94
Name: Sales, dtype: float64

### Q9. What Product is most frequently purchased over the all period?

In [59]:
all_data_2019.Product.value_counts()[[0]]

USB-C Charging Cable    21903
Name: Product, dtype: int64

### Q10. List out the Product price above 100$

In [65]:
all_data_2019[pd.to_numeric(all_data_2019["Price Each"])>100][['Product','Price Each']]

                         Product Price Each
3                   Google Phone        600
9             Macbook Pro Laptop       1700
11                  Google Phone        600
13        27in 4K Gaming Monitor     389.99
16      Apple Airpods Headphones        150
...                          ...        ...
186841              Google Phone        600
186843  Apple Airpods Headphones        150
186846                    iPhone        700
186847                    iPhone        700
186848    34in Ultrawide Monitor     379.99

[68964 rows x 2 columns]